In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
sns.set()

In [10]:
arr = np.arange(10)
arr

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [11]:
np.cumsum(arr)

array([ 0,  1,  3,  6, 10, 15, 21, 28, 36, 45], dtype=int32)

In [7]:
arr2 = np.arange(10).reshape(2, 5)

In [9]:
np.cumsum(arr2)

array([ 0,  1,  3,  6, 10, 15, 21, 28, 36, 45], dtype=int32)

In [10]:
arr = np.random.randint(0, 1000, 1000000)
df = pd.DataFrame(arr)
df.head()

     0
0  757
1  564
2  563
3  296
4   64

In [17]:
df.sum()

0    499090787
dtype: int64

In [20]:
%timeit max(df[0])

119 ms ± 1.49 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [21]:
%timeit df.max()

2.04 ms ± 67.7 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [11]:
%timeit sum(arr)

90.6 ms ± 401 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [13]:
%timeit arr.sum()

538 µs ± 9.98 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [13]:
df = pd.DataFrame(np.random.random(size=(5, 3)), columns=list('ABC'))
df

          A         B         C
0  0.909918  0.476746  0.412136
1  0.307706  0.689501  0.036212
2  0.293463  0.817175  0.003956
3  0.568507  0.772181  0.741288
4  0.145785  0.420930  0.196247

In [18]:
df.sum(axis=1)

0    1.798800
1    1.033419
2    1.114594
3    2.081977
4    0.762962
dtype: float64

In [20]:
df.min(axis=1)

0    0.412136
1    0.036212
2    0.003956
3    0.568507
4    0.145785
dtype: float64

In [26]:
df['D'] = 5

In [27]:
df

          A         B         C  D
0  0.909918  0.476746  0.412136  5
1  0.307706  0.689501  0.036212  5
2  0.293463  0.817175  0.003956  5
3  0.568507  0.772181  0.741288  5
4  0.145785  0.420930  0.196247  5

In [37]:
df = pd.DataFrame(
        np.random.randn(3, 2), 
        columns=['foo', 'bar'], 
        index=['a', 'b', 'c'])
df

        foo       bar
a -0.922288  0.017413
b -0.527411  1.605322
c -0.233553  2.215226

In [31]:
df.loc['b', 'foo'] = np.nan
df.loc['a', 'bar'] = np.nan
df

        foo       bar
a  1.160275       NaN
b       NaN  0.447687
c  0.512915  0.433254

In [35]:
df[df.foo.isnull()]

   foo       bar
b  NaN  0.447687

In [38]:
pd.Series({
        ('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102})

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64